In [2]:
#pandas
#Series - 1 dimension - array, sizeimmutable
#Dataframe - 2 dimension - size-mutable tabular structure with potentially heterogeneously typed columns
#Panel - 3 dimension - size-mutable array
import pandas
s=pandas.Series()
print(s)

Series([], dtype: float64)

In [3]:
import pandas
import numpy
data = numpy.array(['a','b','c','d'])
s=pandas.Series(data)
print(s)

0    a
1    b
2    c
3    d
dtype: object

In [4]:
import pandas
import numpy
data = numpy.array(['a','b','c','d'])
s=pandas.Series(data,index=[100,101,102,103])
print(s)

100    a
101    b
102    c
103    d
dtype: object

In [5]:
import pandas
import numpy
data = {'a' : 0., 'b' : 1., 'c' : 2.}
print(data)
s = pandas.Series(data)
print(s)

{'a': 0.0, 'b': 1.0, 'c': 2.0}
a    0.0
b    1.0
c    2.0
dtype: float64

In [6]:
#A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns.
#A pandas DataFrame can be created using various inputs like âˆ’
# Lists
# dict
# Series
# Numpy ndarrays
# Another DataFrame
import pandas as pd
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [8]:
import pandas
data= [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data)
print(df)

        0   1
0    Alex  10
1     Bob  12
2  Clarke  13

In [1]:
import pandas
data= [['Alex',10],['Bob',12],['Clarke',13]]
df = pandas.DataFrame(data,columns=['Name','Age'])
df.head

<bound method NDFrame.head of      Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13>

In [2]:
import pandas
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pandas.DataFrame(data)
df.head

<bound method NDFrame.head of    Age   Name
0   28    Tom
1   34   Jack
2   29  Steve
3   42  Ricky>

In [16]:
import pandas
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
df = pandas.DataFrame(data)
print(df)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [19]:
import pandas
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pandas.DataFrame(data)
print(df)
sorteddf=df.sort_index(ascending=False)
print(sorteddf)

   Age   Name
0   28    Tom
1   34   Jack
2   29  Steve
3   42  Ricky
   Age   Name
3   42  Ricky
2   29  Steve
1   34   Jack
0   28    Tom

In [23]:
import pandas
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pandas.DataFrame(data)
print(df)
sorteddf=df.sort_values(by='Age')
print(sorteddf)

   Age   Name
0   28    Tom
1   34   Jack
2   29  Steve
3   42  Ricky
   Age   Name
0   28    Tom
2   29  Steve
1   34   Jack
3   42  Ricky

In [3]:
import pandas as pd
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df.head

<bound method NDFrame.head of     Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017>

In [4]:
import pandas as pd
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
grouped=df.groupby('Year')
grouped2014=grouped.get_group(2014)
print(grouped2014)

     Team  Rank  Year  Points
0  Riders     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701

In [38]:
import pandas as pd
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
grouped=df.groupby('Year')
for name,group in grouped:
    print(name)
    print(group)

2014
   Points  Rank    Team  Year
0     876     1  Riders  2014
2     863     2  Devils  2014
4     741     3   Kings  2014
9     701     4  Royals  2014
2015
    Points  Rank    Team  Year
1      789     2  Riders  2015
3      673     3  Devils  2015
5      812     4   kings  2015
10     804     1  Royals  2015
2016
   Points  Rank    Team  Year
6     756     1   Kings  2016
8     694     2  Riders  2016
2017
    Points  Rank    Team  Year
7      788     1   Kings  2017
11     690     2  Riders  2017

In [42]:
import pandas as pd
left = pd.DataFrame({
         'id':[1,2,3,4,5],
         'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']})
right = pd.DataFrame(
         {'id':[1,2,3,4,5],
         'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']})
print(left)
print(right)

     Name  id subject_id
0    Alex   1       sub1
1     Amy   2       sub2
2   Allen   3       sub4
3   Alice   4       sub6
4  Ayoung   5       sub5
    Name  id subject_id
0  Billy   1       sub2
1  Brian   2       sub4
2   Bran   3       sub3
3  Bryce   4       sub6
4  Betty   5       sub5

In [5]:
import pandas as pd
data={'day':['1/1/2018','1/3/2018','1/2/2018'],'teparature':[23,32,34]}
df=pd.DataFrame(data)
df

        day  teparature
0  1/1/2018          23
1  1/3/2018          32
2  1/2/2018          34

In [6]:
import pandas as pd
data={'day':['1/1/2018','1/3/2018','1/2/2018'],'teparature':[23,32,34]}
df=pd.DataFrame(data)
df[0:1]

        day  teparature
0  1/1/2018          23

In [17]:
import pandas as pd
data={'day':['1/1/2018','1/3/2018','1/2/2018'],'teparature':[23,32,34]}
df=pd.DataFrame(data)
df.teparature

0    23
1    32
2    34
Name: teparature, dtype: int64

In [5]:
import pandas as pd
data={'day':['1/1/2018','1/3/2018','1/2/2018'],'teparature':[23,32,34]}
df=pd.DataFrame(data)
df['teparature'].max()

34

In [3]:
# dict to dataframe
import pandas as pd
data={'day':['1/1/2018','1/3/2018','1/2/2018'],'teparature':[23,32,34]}
df=pd.DataFrame(data)
df[df.teparature>=32]
df

pandas.core.frame.DataFrame

In [14]:
import pandas as pd
data={'day':['1/1/2018','1/3/2018','1/2/2018'],'teparature':[23,32,34]}
df=pd.DataFrame(data)
df[df.teparature==df['teparature'].max()]

        day  teparature
2  1/2/2018          34

In [24]:
import pandas as pd
drinks = pd.DataFrame({'country':['India','India','India','China','China','China'],'day':['1/1/2018','1/3/2018','1/2/2018','1/1/2018','1/3/2018','1/2/2018'],'temparature':[23,32,34,24,33,35]})
drinks.head()

  country       day  temparature
0   India  1/1/2018           23
1   India  1/3/2018           32
2   India  1/2/2018           34
3   China  1/1/2018           24
4   China  1/3/2018           33

In [25]:
drinks.day

0    1/1/2018
1    1/3/2018
2    1/2/2018
3    1/1/2018
4    1/3/2018
5    1/2/2018
Name: day, dtype: object

In [27]:
drinks.temparature

0    23
1    32
2    34
3    24
4    33
5    35
Name: temparature, dtype: int64

In [28]:
drinks.country

0    India
1    India
2    India
3    China
4    China
5    China
Name: country, dtype: object

In [29]:
drinks.groupby('country').max()

              day  temparature
country
China    1/3/2018           35
India    1/3/2018           34

In [30]:
drinks.groupby('country').mean()

         temparature
country
China      30.666667
India      29.666667

In [31]:
drinks.groupby('country').temparature.mean()

country
China    30.666667
India    29.666667
Name: temparature, dtype: float64

In [32]:
drinks[drinks.country=='India'].temparature.mean()

29.666666666666668

In [37]:
drinks.groupby('country').temparature.agg(['count','min','max','mean'])

         count  min  max       mean
country
China        3   24   35  30.666667
India        3   23   34  29.666667

In [2]:
import pandas as pd
import numpy as np

In [4]:
series1 = pd.Series(data=['Venkat','Balaji','Vijay'], index=['dn','ds','rpa'])

In [5]:
series1

dn     Venkat
ds     Balaji
rpa     Vijay
dtype: object

In [6]:
series2 = pd.Series(data=['Venkat','Balaji','Vijay'], index=['dn','ds','rpa'])

In [7]:
series2

dn     Venkat
ds     Balaji
rpa     Vijay
dtype: object

In [8]:
series1+series2

dn     VenkatVenkat
ds     BalajiBalaji
rpa      VijayVijay
dtype: object

In [9]:
series3 = pd.Series(data=['a','e','i','o','u'])
series3

0    a
1    e
2    i
3    o
4    u
dtype: object

In [10]:
series3[0]

'a'

In [4]:
series3 = pd.Series(3,index=['Venkat','Balaji','Vijay'])
series3

Venkat    3
Balaji    3
Vijay     3
dtype: int64

In [1]:
import pandas as pd

In [4]:
sales=pd.DataFrame({'weekday':['sun','sun','mon','mon'],'city':['Austin','Dallas','Austin','Dallas'],'bread':[139,237,326,456],'butter':[20,45,70,98]})
sales

  weekday    city  bread  butter
0     sun  Austin    139      20
1     sun  Dallas    237      45
2     mon  Austin    326      70
3     mon  Dallas    456      98

In [6]:
sales.groupby('weekday').count()

         city  bread  butter
weekday
mon         2      2       2
sun         2      2       2

In [7]:
sales.groupby('weekday')['bread'].sum()

weekday
mon    782
sun    376
Name: bread, dtype: int64

In [8]:
sales.groupby('weekday').sum()

         bread  butter
weekday
mon        782     168
sun        376      65

In [9]:
sales.groupby('city')['bread'].max()

city
Austin    326
Dallas    456
Name: bread, dtype: int64

In [15]:
sales.groupby('city')['bread','butter'].max()

        bread  butter
city
Austin    326      70
Dallas    456      98

In [10]:
sales.groupby('city')['bread'].min()

city
Austin    139
Dallas    237
Name: bread, dtype: int64

In [13]:
sales.groupby('city')['bread','butter'].agg(['max'])

       bread butter
         max    max
city
Austin   326     70
Dallas   456     98

In [9]:
import pandas as pd
import numpy as np

In [19]:
df=pd.DataFrame({'A':[1,2,3,4],
              'B':pd.Timestamp('20200301'),
               'C':pd.Series(1,index=list(range(4))),
               'D':np.array([5]*4),
                 'E':pd.Categorical(['true','false','true','false']),
                 'F':'eduinsta',
                 'G':[True,False,True,False],
                })
df

   A          B  C  D      E         F      G
0  1 2020-03-01  1  5   true  eduinsta   True
1  2 2020-03-01  1  5  false  eduinsta  False
2  3 2020-03-01  1  5   true  eduinsta   True
3  4 2020-03-01  1  5  false  eduinsta  False

In [20]:
df.size

28

In [21]:
df.shape

(4, 7)